In [246]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split

df = pd.read_csv("penguins.csv")

display(df.head())
display(df.info())
display(df.describe())

# Veri hakkında bilgi edinmek için bu komutlar kullanılır, gerekli bilgiler aşağıdadır.

,id,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 344 non-null    int64
 1   species            344 non-null    object
 2   island             344 non-null    object
 3   bill_length_mm     342 non-null    float64
 4   bill_depth_mm      342 non-null    float64
 5   flipper_length_mm  342 non-null    float64
 6   body_mass_g        342 non-null    float64
 7   sex                333 non-null    object
 8   year               344 non-null    int64
dtypes: float64(4), int64(2), object(3)
memory usage: 24.3+ KB

None

,id,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,year
count,344.000000,342.000000,342.000000,342.000000,342.000000,344.000000
mean,171.500000,43.921930,17.151170,200.915205,4201.754386,2008.029070
std,99.448479,5.459584,1.974793,14.061714,801.954536,0.818356
min,0.000000,32.100000,13.100000,172.000000,2700.000000,2007.000000
25%,85.750000,39.225000,15.600000,190.000000,3550.000000,2007.000000
50%,171.500000,44.450000,17.300000,197.000000,4050.000000,2008.000000
75%,257.250000,48.500000,18.700000,213.000000,4750.000000,2009.000000
max,343.000000,59.600000,21.500000,231.000000,6300.000000,2009.000000

In [247]:
df.isnull().sum()

# Her satırda kaç tane NaN değerinin olduğunu öğrenmek için kullanılır.

id                    0
species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
year                  0
dtype: int64

In [248]:
df = df.fillna(df.median(numeric_only=True))
df = df.fillna(df.select_dtypes(include=["object", "category"]).mode().iloc[0])
df.isnull().sum()

# NaN olan verilerde, sayısal değerleri ortanca değer ile, kategorik değerleri en çok tekrar eden ile değiştirir.

id                   0
species              0
island               0
bill_length_mm       0
bill_depth_mm        0
flipper_length_mm    0
body_mass_g          0
sex                  0
year                 0
dtype: int64

In [249]:
df["sex"] = df["sex"].map({"male": 0, "female": 1}).astype("Int32")
print(df["sex"].head())

# Sex sütunu sayısal hale getirildi.

0    0
1    1
2    1
3    0
4    1
Name: sex, dtype: Int32

In [250]:
label = df["sex"] 
features = df.drop("sex", axis=1)
X_train,X_test,y_train,y_test = train_test_split(features, label, test_size=0.2, random_state = 42)

# Değişken ve özellik sütunları ayırıldı ve eğitim ve test seti olarak ayırıldı.

In [251]:
print("\nEgitim ve Test Seti Boyutları:")
print("X_train:", X_train.shape)
print("X_test:", X_test.shape)
print("y_train:", y_train.shape)
print("y_test:", y_test.shape)

# Eğitim ve test boyutları ekrana yazdırılmıştır.

Egitim ve Test Seti Boyutları:
X_train: (275, 8)
X_test: (69, 8)
y_train: (275,)
y_test: (69,)